# YOLOv8 模型配置

# 参数设置
nc: 80  # 类别数量
depth_multiple: 0.33  # 模型深度倍数
width_multiple: 0.25  # 模型宽度倍数

# 锚框配置
anchors: 3  # 每个尺度的锚框数量

# 主干网络
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],    # 1-P2/4
   [-1, 1, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],    # 3-P3/8
   [-1, 2, C3, [128]],
   [-1, 1, Conv, [128, 3, 2]],    # 5-P4/16
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [128, 3, 2]],    # 7-P5/32
   [-1, 1, C3, [128]],
   [-1, 1, SPPF, [128, 5]],      # 9
  ]

# 头部网络
head:
  [[-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [64, False]],  # 13

   [-1, 1, Conv, [32, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [32, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [32, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [64, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [128, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ] 